Repository: yaolin-dev/OKVideoMac
Catalog: OKVideoMac/macOS/OKVideoMac/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hant

# player.queue.choose-resource
source: This episode has %d resources. Choose one to continue.
zh_hans: 该集有 %d 个资源，请选择一个继续播放。
zh_hant: 該集有 %d 個資源，請選擇一個繼續播放。

# player.queue.unresolved
source: Cannot determine an adjacent episode. Choose from the episode list.
zh_hans: 无法确定相邻分集，请从选集列表选择。
zh_hant: 無法確定相鄰分集，請從選集清單選擇。

# player.queue.show-all
source: Show All Episodes
zh_hans: 查看全部分集
zh_hant: 查看全部分集

# player.previous-episode.choose
source: Choose Previous Episode…
zh_hans: 选择上一集…
zh_hant: 選擇上一集…

# player.next-episode.choose
source: Choose Next Episode…
zh_hans: 选择下一集…
zh_hant: 選擇下一集…

# updates.title
source: Software Updates
zh_hans: 软件更新
zh_hant: 軟體更新

# updates.check
source: Check for Updates…
zh_hans: 检查更新…
zh_hant: 檢查更新…

# updates.automatic
source: Automatically Check for Updates
zh_hans: 自动检查更新
zh_hant: 自動檢查更新

# updates.consent-note
source: Checks once a day. Download and installation require your confirmation.
zh_hans: 每天检查一次。下载和安装都需要你确认。
zh_hant: 每天檢查一次。下載和安裝都需要你確認。

# updates.unconfigured
source: This build has no update feed configured.
zh_hans: 此版本尚未配置更新源。
zh_hant: 此版本尚未設定更新來源。

# updates.local-channel
source: Local test channel · Keep the local update server running.
zh_hans: 本地测试通道 · 请保持本机更新服务运行。
zh_hant: 本機測試通道 · 請保持本機更新服務運作。

# updates.stable-channel
source: Stable channel
zh_hans: 稳定通道
zh_hant: 穩定通道

# updates.available
source: Update Available
zh_hans: 有新版本
zh_hant: 有新版本

# updates.last-check
source: Last checked
zh_hans: 上次检查
zh_hant: 上次檢查

# updates.busy.title
source: Update in Progress
zh_hans: 正在更新
zh_hant: 正在更新

# updates.restart-busy
source: Finish the current update before restarting the app.
zh_hans: 请先完成或取消更新，再重启应用。
zh_hant: 請先完成或取消更新，再重新啟動應用程式。

# updates.check-busy
source: Finish the current restart before checking for updates.
zh_hans: 请等待当前重启完成后再检查更新。
zh_hant: 請等待目前重新啟動完成後再檢查更新。

# updates.finishing.title
source: Finishing playback cleanup
zh_hans: 正在完成播放清理
zh_hant: 正在完成播放清理

# updates.finishing.message
source: The update is waiting for playback and history cleanup. Installation will continue when cleanup finishes.
zh_hans: 更新正在等待播放器与历史记录清理完成。清理完成后将继续安装。
zh_hant: 更新正在等待播放器與歷史記錄清理完成。清理完成後將繼續安裝。

# detail.source-updated
source: This source's configuration changed. Retry to load the updated details.
zh_hans: 当前源的配置已更新，请重试加载详情。
zh_hant: 目前來源的設定已更新，請重試載入詳情。

# player.ended.no-next
source: No next episode is available in this playback line and version.
zh_hans: 当前线路和版本没有可用的下一集。
zh_hant: 目前線路和版本沒有可用的下一集。

# player.ended.reload-list
source: Reload episode list
zh_hans: 重新加载分集列表
zh_hant: 重新載入分集列表

# player.ended.preparing
source: Preparing the episode list…
zh_hans: 正在准备分集列表…
zh_hant: 正在準備分集列表…

# player.ended.replay
source: Replay
zh_hans: 重播
zh_hant: 重播

# player.ended.title
source: Playback Finished
zh_hans: 已播放完
zh_hant: 已播放完

# player.queue.preparing
source: Loading episode list
zh_hans: 分集列表正在加载
zh_hant: 分集清單正在載入

# player.queue.unavailable
source: No episode list available
zh_hans: 暂无可用分集列表
zh_hant: 暫無可用分集清單

# player.queue.no-adjacent
source: No adjacent episode available
zh_hans: 没有可切换的相邻分集
zh_hant: 沒有可切換的相鄰分集

# configuration.action.timeout
source: The operation timed out. Refresh the configuration to check its current state before retrying.
zh_hans: 操作等待超时。请刷新配置，确认当前状态后再重试。
zh_hant: 操作等待逾時。請重新整理設定，確認目前狀態後再重試。

# configuration.action.finished
source: Operation finished
zh_hans: 操作已结束
zh_hant: 操作已結束

# cloud.complete-resume
source: Check Login and Resume
zh_hans: 检查登录并继续播放
zh_hant: 檢查登入並繼續播放

# cloud.configuration.open-web
source: Open Configuration Web Page
zh_hans: 打开配置网页
zh_hant: 開啟設定網頁

# live.guide.next-channels
source: Next Channels
zh_hans: 下一组频道
zh_hant: 下一組頻道

# live.guide.previous-channels
source: Previous Channels
zh_hans: 上一组频道
zh_hant: 上一組頻道

# live.guide.channels
source: Channels
zh_hans: 频道
zh_hant: 頻道

# live.programme-progress
source: Programme Progress
zh_hans: 节目进度
zh_hant: 節目進度

# player.audio.apply.failed
source: Audio setting could not be applied; your preference is saved.
zh_hans: 音量设置未能应用，已保留你的选择，可重试。

# player.next-resource
source: Next Resource
zh_hans: 下一个资源

# player.previous-resource
source: Previous Resource
zh_hans: 上一个资源

# player.resource-count
source: %d resources
zh_hans: %d 个资源

# episode.issue
source: Issue %d
zh_hans: 第 %d 期

# episode.finale
source: Finale
zh_hans: 大结局

# player.seek.wait-timeout
source: Seeking is taking too long. Retry this position or choose another position.
zh_hans: 跳转等待较久，可重新尝试或选择其他位置。

# detail.authorization.pending
source: Complete authorization, then retry loading details.
zh_hans: 完成授权后，可在此重试加载详情。

# detail.request-cancelled
source: Detail loading was interrupted. You can retry here.
zh_hans: 详情加载已中断，可在此重试。

# detail.request-timeout
source: This provider is taking too long. Your page is preserved; you can retry.
zh_hans: 来源响应超时，已保留当前页面，可重试加载。

# detail.search-returned
source: This provider returned a search suggestion instead of details. Retry or continue searching.
zh_hans: 来源返回了搜索建议，未取得影片详情。可重试或继续搜索。

# detail.continue-search
source: Continue Searching
zh_hans: 继续搜索

# detail.area
source: Region
zh_hans: 地区

# detail.director
source: Director
zh_hans: 导演

# browser.refresh.resume
source: Continue Search
zh_hans: 继续搜索

# browser.refresh.retry
source: Retry Failed Requests
zh_hans: 重试失败请求

# browser.refresh.loading
source: Loading…
zh_hans: 正在加载…

# detail.synopsis
source: Synopsis
zh_hans: 简介

# browser.refresh.again
source: Refresh All in This Scope
zh_hans: 重新刷新当前范围

# search.filters.all
source: All Results
zh_hans: 全部结果

# search.browse.waiting-providers
source: Results are ready; some providers are still searching…
zh_hans: 已有结果，仍在搜索部分站点…
zh_hant: 已有結果，仍在搜尋部分站點…

# search.browse.loading
source: Searching for more results…
zh_hans: 正在搜索更多结果…

# search.browse.stopped
source: Search stopped; results retained
zh_hans: 搜索已停止，已保留现有结果

# search.browse.paused
source: More sources found; continue loading when ready
zh_hans: 已补充影片来源，可继续加载

# search.browse.partial
source: Some providers need attention; other results can continue
zh_hans: 部分来源异常，其他来源可继续加载

# search.browse.continue
source: More results are available
zh_hans: 可继续加载搜索结果

# search.browse.failed
source: Some providers failed; results retained
zh_hans: 部分来源加载失败，已保留现有结果

# search.browse.limited
source: Further paging is not confirmed for this provider
zh_hans: 部分来源的后续分页尚未确认支持

# search.browse.complete
source: All results in this scope have loaded
zh_hans: 当前范围的搜索结果已全部加载

# search.browse.pending
source: No further page has been confirmed
zh_hans: 尚未确认后续页面

# search.browse.resume
source: Continue / Retry
zh_hans: 继续 / 重试

# search.browse.sources
source: %d sources
zh_hans: %d 个来源

# search.browse.source-empty
source: This provider has no results yet. Check its search status or retry below.
zh_hans: 此来源尚无搜索结果，可查看搜索状态或在下方重试。

# search.folder.title
source: Folder
zh_hans: 文件夹

# search.browse.provider-count
source: %@: %d results
zh_hans: %@: %d 条结果

# pagination.uncertain
source: No new titles; the end of results is not confirmed
zh_hans: 暂未获得新内容，尚不能确认是否已加载完

# cloud.authorization.media-check
source: Playback failed, but account expiration has not been confirmed. Check cloud authorization here; after saving, the app will verify and resume only the current title once.
zh_hans: 播放未成功，但尚未确认账号授权失效。可以在此检查网盘授权；保存后只验证并恢复当前影片一次。

# player.quark.media-rejected
source: Quark rejected a video request (HTTP %lld). This does not by itself mean your account authorization has expired. Retry or check authorization.
zh_hans: 夸克拒绝了视频请求（HTTP %lld），尚不能据此认定账号授权过期。可以重试或检查授权。

# player.quark.rate-limited
source: Quark is limiting requests. Wait a moment before trying again.
zh_hans: 夸克暂时限制了请求频率，请稍后重试，无需删除授权。

# player.quark.server-unavailable
source: The Quark media server is temporarily unavailable (HTTP %lld). Try again later.
zh_hans: 夸克视频服务器暂不可用（HTTP %lld），请稍后重试。

# player.quark.resource-unavailable
source: The Quark video resource is unavailable (HTTP %lld). Check whether the share or file still exists.
zh_hans: 夸克视频资源不可用（HTTP %lld），请检查分享或文件是否仍然存在。

# home.category.view-update
source: Content Updated — View
zh_hans: 内容已更新 · 查看

# pagination.continue
source: Continue Loading
zh_hans: 继续加载

# pagination.no-progress
source: The provider returned no new titles. Automatic loading is paused; you can retry.
zh_hans: 来源未返回新内容，已暂停自动加载，可点击重试。

# home.category.empty
source: No titles in this category.
zh_hans: 此分类暂无内容

# live.guide.previous
source: Previous 12 Hours
zh_hans: 前 12 小时

# live.guide.date
source: Guide Date
zh_hans: 节目单日期

# live.guide.now
source: Now
zh_hans: 现在

# live.guide.next
source: Next 12 Hours
zh_hans: 后 12 小时

# live.guide.channel-page
source: Channels %d–%d of %d
zh_hans: 频道 %d–%d / 共 %d 个

# live.guide.xtream-nearby-only
source: This source provides nearby programmes only
zh_hans: 此来源仅提供近期节目

# live.guide.partial
source: %d rows unavailable
zh_hans: %d 个频道暂不可用

# live.guide.refreshing
source: Refreshing…
zh_hans: 正在更新…

# live.guide.stale
source: Saved schedule
zh_hans: 已保存的节目单

# live.guide.short.unsupported
source: This source does not provide a full schedule yet.
zh_hans: 此来源暂不提供完整节目单。

# live.guide.failed
source: The programme guide could not be loaded. Channel playback is still available.
zh_hans: 节目单加载失败，仍可正常播放频道。

# live.guide.invalid
source: The programme guide returned an invalid window.
zh_hans: 节目单返回的时间范围无效。

# live.guide.loading
source: Loading programme guide…
zh_hans: 正在加载节目单…

# live.guide.empty
source: No programme entries in this window
zh_hans: 此时间范围内暂无节目

# live.guide.play-channel
source: Play Channel
zh_hans: 播放频道

# live.guide.row.loading
source: Loading…
zh_hans: 正在加载…

# live.guide.row.empty
source: No programmes
zh_hans: 暂无节目

# live.guide.row.unmatched
source: Channel not matched
zh_hans: 未匹配到频道

# live.guide.row.ambiguous
source: Multiple channel matches
zh_hans: 匹配到多个频道

# live.guide.row.unsupported
source: Not provided
zh_hans: 来源未提供

# live.guide.row.failed
source: Unavailable
zh_hans: 暂不可用

# live.guide.row.truncated
source: Partially loaded
zh_hans: 已加载部分节目

# live.guide.show
source: Show programme guide
zh_hans: 显示节目单

# live.guide.title
source: Program Guide
zh_hans: 节目单

# live.background.native-disabled
source: Programme guide is disabled.
zh_hans: 节目单已关闭。

# live.background.title
source: Background Activity
zh_hans: 后台活动

# live.background.running
source: Working
zh_hans: 正在处理

# live.background.attention
source: Needs attention
zh_hans: 有任务未能完成

# live.background.idle
source: No active tasks
zh_hans: 没有正在运行的任务

# live.background.catalog
source: Channel List
zh_hans: 频道目录

# live.background.catalog-loading
source: Updating channel list…
zh_hans: 正在更新频道目录…

# live.background.catalog-cached
source: Update failed; keeping the existing list.
zh_hans: 目录更新失败，继续使用现有列表。

# live.background.catalog-failed
source: Unable to load channels. Retry using the refresh button.
zh_hans: 无法加载频道，请使用刷新按钮重试。

# live.background.native
source: Programme data is loaded on demand and shown on channel cards.
zh_hans: 节目单按需获取，结果显示在频道卡片中。

# live.background.epg
source: Programme Guide
zh_hans: 节目单

# live.background.cache-expired
source: Using cached data · programme data expired
zh_hans: 使用缓存 · 节目数据已过期

# live.background.cache
source: Using cached data
zh_hans: 使用缓存

# live.background.data-until
source: Data through %@
zh_hans: 数据截至 %@

# live.background.disabled
source: Disabled
zh_hans: 已关闭

# live.background.unconfigured
source: No programme guide configured
zh_hans: 未配置节目单

# live.background.epg-loading
source: Loading programme guide…
zh_hans: 正在加载节目单…

# live.background.epg-refreshing
source: Updating programme guide…
zh_hans: 正在更新节目单…

# live.background.epg-failed
source: Unable to update programme guide
zh_hans: 节目单更新失败

# live.background.expired
source: Programme data expired; waiting for an update
zh_hans: 节目数据已过期，等待更新

# live.background.empty
source: No programme data
zh_hans: 暂无节目数据

# live.background.loaded
source: Loaded
zh_hans: 已载入

# live.background.waiting
source: Waiting to load
zh_hans: 等待加载

# live.background.validation
source: Channel Check
zh_hans: 频道检测

# live.background.stop
source: Stop
zh_hans: 停止

# live.background.conservative
source: Channels whose availability cannot be confirmed are kept.
zh_hans: 无法确认是否可用的频道会保留。

# live.background.not-checked
source: Not checked yet
zh_hans: 尚未检测

# live.background.checked-count
source: Checked %d / %d
zh_hans: 已检测 %d / %d

# live.background.processing
source: Processing results…
zh_hans: 正在处理检测结果…

# live.background.completed
source: Checked %d channels; %d confirmed unavailable
zh_hans: 已检测 %d 个频道，确认 %d 个不可用

# live.background.cancelled
source: Stopped; no incomplete results applied
zh_hans: 已停止，本轮未应用不完整结果

# live.background.partial
source: Time limit reached; no incomplete results applied
zh_hans: 已达到时间限制，本轮未应用不完整结果

# live.background.failed
source: Check could not finish. Retry using the refresh button.
zh_hans: 检测未完成，请使用刷新按钮重试。

# settings.epg.title
source: EPG / Programme Guide
zh_hans: EPG / 节目单

# settings.epg.enabled
source: Automatically Load EPG
zh_hans: 自动加载 EPG

# settings.epg.enabled-help
source: Automatically load current and next programmes for supported live TV sources.
zh_hans: 为支持节目单的直播源自动加载当前和下一节目

# settings.epg.default-url
source: Default EPG Address
zh_hans: 默认 EPG 地址

# settings.epg.default-help
source: HTTP/HTTPS XMLTV or XMLTV.gz. Used only when an automatic source has no embedded EPG. Changes take effect after saving.
zh_hans: 支持 HTTP/HTTPS XMLTV 或 XMLTV.gz；仅用于没有内嵌 EPG 的自动直播源。保存后生效。

# settings.epg.reset
source: Restore Default
zh_hans: 恢复默认

# settings.epg.save
source: Save
zh_hans: 保存

# settings.epg.edit
source: Programme Guide…
zh_hans: 节目单…

# settings.epg.automatic
source: Automatic
zh_hans: 自动

# settings.epg.custom
source: Custom
zh_hans: 自定义

# settings.epg.disabled
source: Do Not Use EPG
zh_hans: 不使用 EPG

# settings.epg.automatic-help
source: Automatic: embedded M3U EPG → global default → none. The app-wide EPG switch applies to all sources.
zh_hans: 自动：M3U 内嵌 EPG → 全局默认 EPG → 无。应用级总开关对所有源生效。

# settings.epg.save-failed
source: Unable to Save Programme Settings
zh_hans: 无法保存节目单设置

# settings.epg.invalid-url
source: Enter a valid HTTP or HTTPS XMLTV address and try again. Your previous settings have been kept.
zh_hans: 请输入有效的 HTTP 或 HTTPS XMLTV 地址后重试。原设置已保留。

# live.epg.refresh-failed
source: Programme refresh failed; any saved schedule is still available.
zh_hans: 节目表刷新失败；仍可查看已保存的节目表。

# live.epg.cached
source: Cached
zh_hans: 旧缓存

# live.epg.progress
source: Programme progress
zh_hans: 节目进度

# live.epg.no-current
source: No current programme
zh_hans: 暂无当前节目

# live.epg.no-next
source: Next: —
zh_hans: 下一节目：—

# live.epg.unsupported
source: Provider has no programme guide
zh_hans: 此服务商不提供节目表

# live.epg.unavailable
source: Programme guide unavailable
zh_hans: 节目表暂不可用

# settings.android.action.uninstall-runtime
source: Uninstall OKVideoMac-managed Components…
zh_hans: 卸载 OKVideoMac 管理的组件…

# settings.android.uninstall.title
source: Uninstall OKVideoMac-managed Android components?
zh_hans: 卸载 OKVideoMac 管理的 Android 组件？

# settings.android.uninstall.message
source: Approximately %@ will be removed. The OKVideoMac Android session will be stopped first. Android sign-in data, user-data backups, private keys, and your external SDK selection will be kept. External SDK files will not be deleted.
zh_hans: 预计清理约 %@。将先停止 OKVideoMac Android 会话。Android 登录数据、用户数据备份、私有密钥和外部 SDK 选择将保留，不会删除外部 SDK 文件。

# settings.android.uninstall.confirm
source: Uninstall Components
zh_hans: 卸载组件

# settings.android.uninstall.running
source: Stopping Android and checking the uninstall transaction…
zh_hans: 正在停止 Android 并检查卸载事务…

# settings.android.uninstall.cleanup-pending
source: Components are uninstalled, but some files still need cleanup. Android user data was kept. Retry cleanup before installing again.
zh_hans: 组件已卸载，但部分文件仍待清理。Android 用户数据已保留，请先重试清理再重新安装。

# settings.android.uninstall.success
source: Maintenance completed. Android user data, private keys, and the external SDK were kept.
zh_hans: 维护已完成。Android 用户数据、私有密钥和外部 SDK 已保留。

# settings.android.uninstall.plan-changed
source: The uninstall plan expired or the files changed. Nothing further was removed. Review a new plan and try again.
zh_hans: 卸载计划已过期或文件发生变化，已停止后续删除。请重新查看计划后再试。

# settings.android.uninstall.busy
source: Another Android operation is in progress. Wait for it to finish before trying again.
zh_hans: 其他 Android 操作正在进行，请等待完成后再试。

# settings.android.uninstall.stop-failed
source: The OKVideoMac Android session could not be confirmed stopped. No components were removed.
zh_hans: 无法确认 OKVideoMac Android 会话已停止，未删除任何组件。

# settings.android.uninstall.empty
source: No recognized managed components or installation cache need removal.
zh_hans: 没有需要清理的已识别管理组件或安装缓存。

# settings.android.uninstall.failure
source: Maintenance could not finish safely. Unrecognized files and recovery data were kept. Export diagnostics before trying again.
zh_hans: 维护未能安全完成。未识别文件和恢复数据已保留，请导出诊断信息后再处理。

# settings.android.storage.summary
source: Components: %@ · Installation cache: %@ · Android user data: %@ · Backups: %@
zh_hans: 组件：%@ · 安装缓存：%@ · Android 用户数据：%@ · 备份：%@

# settings.android.storage.incomplete
source: Storage estimate is incomplete. Unverified files will not be removed.
zh_hans: 空间统计不完整，未经验证的文件不会被删除。

# settings.android.uninstall.retry-cleanup
source: Resume Maintenance…
zh_hans: 继续未完成的维护…

# settings.android.storage.calculating
source: Calculating Android storage…
zh_hans: 正在统计 Android 占用…

# settings.android.uninstall.keep-user-data
source: Uninstall keeps Android sign-in data, user-data backups, private keys, and external SDK files.
zh_hans: 卸载会保留 Android 登录数据、用户数据备份、私有密钥和外部 SDK 文件。

# providers.check-again
source: Check Again
zh_hans: 重新检查

# providers.compatibility-details
source: Compatibility Details
zh_hans: 查看兼容性详情

# providers.import.complete
source: %d sites added. This provider is now in use.
zh_hans: 已添加 %d 个站点，正在使用此片源。

# providers.file.help
source: JSON or text configuration. CatPaw settings files belong in the existing provider’s details.
zh_hans: 支持 JSON 或文本配置。CatPaw 设置文件请在已有片源的详情中导入。

# providers.file.select
source: Choose a TVBox Configuration
zh_hans: 选择 TVBox 配置文件

# providers.advanced
source: Advanced Options
zh_hans: 高级选项

# providers.link.tvbox
source: Configuration link · The app will read the TVBox configuration when adding.
zh_hans: 配置链接 · 添加时将读取 TVBox 类配置

# providers.link.catpaw
source: CatPawOpen link · The app will check compatibility when adding.
zh_hans: CatPawOpen 链接 · 添加时将检查兼容性

# providers.import.help
source: Use a TVBox configuration link or file, or a CatPawOpen .js.md5 link.
zh_hans: 支持 TVBox 配置链接或文件，以及 CatPawOpen 的 .js.md5 链接。

# providers.file
source: File
zh_hans: 文件

# providers.link
source: Link
zh_hans: 链接

# providers.add-use
source: Add and Use
zh_hans: 添加并使用

# providers.back
source: Back
zh_hans: 返回

# providers.local.update-help
source: To update this provider, add the new configuration file or text.
zh_hans: 本地配置无法在线更新。如有新版，请重新添加配置文件或文本。

# providers.catpaw.activate-first
source: Use this provider first to manage its CatPaw settings.
zh_hans: 先使用此片源，再管理它的 CatPaw 设置。

# providers.catpaw.unavailable
source: Settings-file import is available when a compatible CatPaw runtime is ready.
zh_hans: 兼容的 CatPaw 服务准备就绪后，才能导入设置文件。

# providers.catpaw.import.help
source: Use test0.db.json to replace this provider’s saved site, account, and cloud settings.
zh_hans: 选择 test0.db.json，替换此片源已保存的站点、账号和网盘等设置。

# providers.catpaw.import
source: Import CatPaw Settings
zh_hans: 导入 CatPaw 设置

# providers.catpaw.help
source: When a site needs a cloud account, opening or playing it will guide you through sign-in.
zh_hans: 站点需要网盘账号时，打开站点或播放内容会引导你登录。

# providers.edit-account
source: Edit Server and Account…
zh_hans: 编辑服务器与账号…

# providers.connection
source: Connection
zh_hans: 片源来源

# providers.method.account.help
source: Xtream · Server address, username, and password
zh_hans: Xtream · 填写服务器地址、用户名和密码

# providers.method.account
source: Sign In with an Account
zh_hans: 使用账号添加

# providers.method.file.help
source: TVBox · Choose a JSON or text configuration from this Mac
zh_hans: TVBox · 选择电脑里保存的 JSON 或文本配置

# providers.method.file
source: Import a Configuration File
zh_hans: 从配置文件添加

# providers.method.link.help
source: TVBox / CatPawOpen · Paste a configuration link
zh_hans: TVBox / CatPawOpen · 粘贴提供方给你的配置链接

# providers.method.link
source: Add Using a Link
zh_hans: 通过链接添加

# providers.choose-method
source: Choose the information you received from your provider.
zh_hans: 根据你手里已有的资料，选择添加方式。

# providers.list.help
source: Each provider may contain several sites. Choose a site on the video home page.
zh_hans: 一个片源可以包含多个站点。添加后，可在点播首页选择其中的站点。

# providers.empty
source: Add a provider above to start watching.
zh_hans: 点击上方“添加”，添加片源后即可开始观看。

# providers.more
source: More Actions
zh_hans: 更多操作

# providers.details
source: Details
zh_hans: 详情

# providers.update
source: Update
zh_hans: 更新片源

# providers.current.subtitle
source: %@ · Used for the video home page and search
zh_hans: %@ · 点播首页和搜索使用此片源

# providers.add.subtitle
source: Use a link, a TVBox configuration file, or an Xtream account.
zh_hans: 通过链接、TVBox 配置文件或 Xtream 账号添加。

# providers.add
source: Add Provider
zh_hans: 添加片源

# common.add
source: Add…
zh_hans: 添加…

# common.edit
source: Edit
zh_hans: 编辑

# xtream.add.action
source: Add Xtream Provider
zh_hans: 添加 Xtream 站点

# xtream.add.subtitle
source: Connect Movies, Series, Search, and Basic Live TV through the native Xtream provider.
zh_hans: 通过原生 Xtream Provider 接入电影、剧集、搜索和基础直播。

# xtream.add.title
source: Add Xtream Account
zh_hans: 添加 Xtream 账号

# xtream.credentials.invalid
source: Enter a valid Xtream username and password.
zh_hans: 请输入有效的 Xtream 用户名和密码。

# xtream.edit.credentials-note
source: For security, enter the username and password again before saving changes.
zh_hans: 为保障安全，保存修改前请重新输入用户名和密码。

# xtream.edit.missing
source: The Xtream provider no longer exists.
zh_hans: 该 Xtream 站点已不存在。

# xtream.edit.title
source: Edit Xtream Provider
zh_hans: 编辑 Xtream 站点

# xtream.editor.subtitle
source: Use your subscription to watch movies, series, and live channels.
zh_hans: 使用你的订阅账号观看电影、剧集和直播频道。

# xtream.episode.fallback
source: Episode %lld
zh_hans: 第 %lld 集

# xtream.name
source: Name (Optional)
zh_hans: 名称（选填）

# xtream.name.placeholder
source: My Xtream Provider
zh_hans: 我的 Xtream 站点

# xtream.operation.in-progress
source: Another provider operation is already in progress.
zh_hans: 另一个站点操作正在进行中。

# xtream.password
source: Password
zh_hans: 密码

# xtream.save.failed
source: Unable to Save Xtream Provider
zh_hans: 无法保存 Xtream 站点

# xtream.save.failed.retry
source: The provider could not be saved. Check the fields and try again.
zh_hans: 无法保存站点，请检查各字段后重试。

# xtream.security-note
source: Credentials are stored only in this Mac’s Keychain. Configuration exports and portable backups never contain them.
zh_hans: 凭据仅存储在这台 Mac 的钥匙串中，配置导出和便携备份绝不会包含凭据。

# xtream.server-url
source: Server Address
zh_hans: 服务器地址

# xtream.source.episodes
source: Episodes
zh_hans: 选集

# xtream.source.movie
source: Movie
zh_hans: 电影

# xtream.source.season
source: Season %lld
zh_hans: 第 %lld 季

# xtream.test-connection
source: Test Connection
zh_hans: 测试连接

# xtream.test.success
source: Connection succeeded.
zh_hans: 连接成功。

# xtream.test.success-with-status
source: Connection succeeded. Account status: %@.
zh_hans: 连接成功，账户状态：%@。

# xtream.testing
source: Testing
zh_hans: 正在测试

# xtream.username
source: Username
zh_hans: 用户名

# error.common.cancelled
source: The operation was cancelled.
zh_hans: 操作已取消。

# error.common.configuration
source: The configuration could not be processed. Check it and try again.
zh_hans: 配置无法处理，请检查后重试。
